"""
Приклад 5: Магія Python (Рядки, великі числа та генератори списків)

Мета: Показати, як Python може легко працювати з рядками та дуже великими числами.
"""

text = "Python це круто"
print(text[::-1])  # Переверне текст задом наперед

print(2 ** 10000)  # 2 у 10-тисячому ступені миттєво

squares = [x**2 for x in range(1, 21) if not x % 2]  # Генератор списків для створення списку квадратів чисел від 1 до 10

print(squares)  # Список квадратів парних чисел від 1 до 20 за допомогою генератора списків
print(f"Сума квадратів парних чисел від 1 до 20: {sum(squares)}")
print(f"Мінімальний квадрат серед парних чисел від 1 до 20: {min(squares)}")
print(f"Максимальний квадрат серед парних чисел від 1 до 20: {max(squares)}")

print("Привіт, " + "світ! " * 3)  # Конкатенація рядків
