"""
Приклад 1: Програма-привітання (Взаємодія) та робота з різними типами даних

Мета: Показати, що програма може "спілкуватися"
    і як використовувати різні типи даних (рядки, числа, булеві значення, кортежі, множини, списки та словники)
    для зберігання та обробки інформації
"""

name: str = input("Як вас звати? ")  # Введення імені користувача, збереження його у змінній типу str
age: int = int(input("Скільки вам років? "))  # Введення віку користувача, збереження його у змінній типу int
print(f"Вітаю, {name}! Вам {age}, і це чудовий вік, щоб опанувати Python!")
print(f"Подвійний вік = {age * 2}!")

b: bool = age >= 18  # Перевірка, чи є користувач дорослим (18 років і старше), збереження результату у змінній типу bool

if b:
    print("Ви вже дорослі, і можете робити багато цікавих речей!")
else:
    print("Ви ще молоді, і у вас попереду багато цікавого!")

r: float = age / 2  # Обчислення половини віку користувача, збереження результату у змінній типу float
print(f"Половина вашого віку = {r}!")

t: tuple = (name, age)  # Створення кортежу з ім'ям та віком користувача, збереження його у змінній типу tuple
print(f"Ваше ім'я та вік у вигляді кортежу: {t}")

name = name.upper()  # Перетворення імені користувача на великі літери, збереження результату у змінній типу str
print(f"Ваше ім'я великими літерами: {name}")
print(f"Ваше ім'я та вік у вигляді кортежу: {t}")

s: set = {7, 1, 2, 3, 4, 5, 1, 2, 6, 3, False, None, "Hello"}  # Створення множини з різними типами даних, збереження її у змінній типу set
print(f"Унікальні числа в наборі: {s}")

l: list = [1, 2, 3, 4, 5]  # Створення списку з числами від 1 до 5, збереження його у змінній типу list
print(f"Список чисел: {l}")

l[3] = 10  # Зміна четвертого елемента списку на 10, демонстрація того, що списки є змінними (mutable)
print(f"Змінений список чисел: {l}")

d: dict = {
    "name": name,
    "age": age,
    "is_adult": b,
    "list": l,
    }  # Створення словника з різними типами даних, збереження його у змінній типу dict
print(f"Словник з ім'ям та віком: {d}")
